---
kind: property
id: P:Autodesk.Revit.DB.SpecTypeId.PipingTemperatureDifference
source: html/9261f833-bb01-502b-91c7-ca5c6f4cefba.htm
---
# Autodesk.Revit.DB.SpecTypeId.PipingTemperatureDifference Property

Temperature Difference, in discipline Piping.

## Syntax (C#)
```csharp
public static ForgeTypeId PipingTemperatureDifference { get; }
```